$( document ).ready(function() {
   $('.tabNavigation a').on('click', function() {
       var year = {};
       switch ($(this).attr('href')) {
           case '#year2014':
               year.data = [
                   ['Country', 'Утечки'],
                   ['Франция',4],
                   ['Ирландия',9],
                   ['Украина',10],
                   ['Китай',15],
                   ['Австралия',18],
                   ['Новая Зеландия',30],
                   ['Канада',33],
                   ['Германия',48],
                   ['Великобритания',80],
                   ['Россия',134],
                   ['США',679],
               ];
               year.option = {
                   width: 600,
                   colorAxis: {colors: ['#e7711c', '#4374e0', '#00853f', 'black', '#e31b23']},
               }; break;
           case '#year2013':
               year.data = [
                   ['Country', 'Утечки'],
                   ['Япония',10],
                   ['Новая Зеландия',10],
                   ['Корея',12],
                   ['Ирландия',15],
                   ['Украина',15],
                   ['Германия',22],
                   ['Австралия',23],
                   ['Канада',46],
                   ['Великобритания',85],
                   ['Россия',167],
                   ['США',906],
               ];
               year.option = {
                   width: 600,
                   colorAxis: {colors: ['#e7711c', '#4374e0', '#00853f', 'black', '#e31b23']},
               }; break;
           case '#year2012':
               year.data = [
               ['Country', 'Утечки'],
               ['США', 576],
               ['Великобритания', 97],
               ['Канада', 32],
               ['Автралия', 19],
               ['Россия', 75],
               ['Ирландия', 11],
               ['Корея', 4],
               ['Китай', 13],
               ['Индия', 10],
               ['Китай', 4],
               ['Германия', 21],
               ['Новоя Зеландия', 7],
               ['Япония', 8],
               ['Швейцария', 6],
               ['Украина', 2],
               ['Финляндия', 2],
               ['Франция', 2],
           ];
               year.option = {
                   width: 600,
                   colorAxis: {colors: ['#e7711c', '#4374e0', '#00853f', 'black', '#e31b23']},
               }; break;
           case '#year2011':
               year.data = [
                   ['Country', 'Утечки'],
                   ['США', 524],
                   ['Великобритания', 127],
                   ['Канада', 31],
                   ['Автралия', 18],
                   ['Россия', 17],
                   ['Ирландия', 11],
                   ['Корея', 10],
                   ['Китай', 9],
                   ['Индия', 6],
                   ['Китай', 5],
                   ['Германия', 5],
                   ['Новоя Зеландия', 3],
                   ['Япония', 2],
                   ['Швейцария', 2],
                   ['Украина', 2],
                   ['Финляндия', 2],
                   ['Франция', 2],
               ];

               year.option = {
                   width: 600,
                   displayMode: 'text',
                   colorAxis: {colors: ['#e7711c', '#4374e0', '#00853f', 'black', '#e31b23']},
               }; break;
           case '#year2010':
               year.data = [
                   ['Country', 'Утечки'],
                   ['США', 580],
                   ['Великобритания', 97],
                   ['Канада', 32],
                   ['Автралия', 18],
                   ['Россия', 75],
                   ['Ирландия', 11],
                   ['Нидерланды', 4],
                   ['Китай', 13],
                   ['Индия', 10],
                   ['Китай', 4],
                   ['Германия', 21],
                   ['Новоя Зеландия', 7],
                   ['Япония', 8],
                   ['Швейцария', 6],
               ];
               year.option = {
                   width: 600,
                   colorAxis: {colors: ['#e7711c', '#4374e0', '#00853f', 'black', '#e31b23']},
               }; break;
           case '#year2009':
               year.data = [
                   ['Country', 'Утечки'],
                   ['США', 576],
                   ['Великобритания', 97],
                   ['Канада', 32],
                   ['Автралия', 19],
                   ['Россия', 75],
                   ['Ирландия', 11],
                   ['Корея', 4],
                   ['Китай', 13],
                   ['Индия', 10],
                   ['Китай', 4],
                   ['Германия', 21],
                   ['Новоя Зеландия', 7],
                   ['Япония', 8],
                   ['Швейцария', 6],
                   ['Украина', 2],
                   ['Финляндия', 2],
                   ['Франция', 2],
               ];

               year.option = {
                   width: 600,
                   displayMode: 'text',
                   colorAxis: {colors: ['#e7711c', '#4374e0', '#00853f', 'black', '#e31b23']},
               }; break;
           case '#year2008':
               year.data = [
                   ['Country', 'Утечки'],
                   ['США', 424],
                   ['Великобритания', 54],
                   ['Канада', 10],
                   ['Германия', 7],
                   ['Россия', 6],
                   ['Ирландия', 5],
                   ['Корея', 4],
                   ['Швейцария', 3],
                   ['Китай', 3],
                   ['Индия', 2],
                   ['Италия', 2],
               ];

               year.option = {
                   width: 600,
                   colorAxis: {colors: ['#e7711c', '#4374e0', '#00853f', 'black', '#e31b23']},
               }; break;
       }
       google.setOnLoadCallback(drawRegionsMap(year));
   })


function drawRegionsMap(year) {
    var data = google.visualization.arrayToDataTable(year.data);
    var options = year.option;

    var chart = new google.visualization.GeoChart(document.getElementById('regions_div'));

    chart.draw(data, options);
}

    $('.tabNavigation a:first').click();

});